# Análise do Dataset

#### Por: Matheus Mendonça Lopes

## Importação dos dataframes

In [80]:
from sqlalchemy import create_engine
import pandas as pd
import psycopg2

In [81]:
SGBD = "postgresql"
USER = "postgres"
SENHA = "admin"
HOST = "localhost"
DATABASE = "brazilian_ecommerce"

engine = create_engine(f"{SGBD}+psycopg2://{USER}:{SENHA}@{HOST}:5432/{DATABASE}")
conn = engine.connect()

In [82]:
query = "SELECT * FROM customers"

df_customers = pd.read_sql_query(query, con = conn)
df_customers.head()

,customer_id,customer_unique_id,customer_zip_code,customer_city,customer_state
0,06b8999e-2fba-1a1f-bc88-172c00ba8bc7,861eff47-11a5-42e4-b938-43c6dd7febb0,14409,franca,SP
1,18955e83-d337-fd6b-2def-6b18a428ac77,290c77bc-529b-7ac9-35b9-3aa66c333dc3,9790,sao bernardo do campo,SP
2,4e7b3e00-2885-86eb-d087-12fdd0374a03,060e732b-5b29-e818-1a18-229c7b0b2b5e,1151,sao paulo,SP
3,b2b6027b-c5c5-109e-529d-4dc6358b12c3,259dac75-7896-d24d-7702-b9acbbff3f3c,8775,mogi das cruzes,SP
4,4f2d8ab1-71c8-0ec8-364f-7c12e35b23ad,345ecd01-c38d-18a9-036e-d96c73b8d066,13056,campinas,SP

In [83]:
query = "SELECT * FROM geolocations"

df_geolocations = pd.read_sql_query(query, con = conn)
df_geolocations.head()

,geolocation_zip_code_prefix,geolocation_lat,geolocation_lng,geolocation_city,geolocation_state
0,1037,-23.545621,-46.639292,sao paulo,SP
1,1046,-23.546081,-46.644820,sao paulo,SP
2,1046,-23.546129,-46.642951,sao paulo,SP
3,1041,-23.544392,-46.639499,sao paulo,SP
4,1035,-23.541578,-46.641607,sao paulo,SP

In [84]:
query = "SELECT * FROM order_items"

df_order_items = pd.read_sql_query(query, con = conn)
df_order_items.head()

,order_id,order_item_id,product_id,seller_id,shipping_limit_date,price,freight_value
0,00010242-fe8c-5a6d-1ba2-dd792cb16214,1,4244733e-06e7-ecb4-970a-6e2683c13e61,48436dad-e18a-c8b2-bce0-89ec2a041202,2017-09-19 09:45:35,58.90,13.29
1,00018f77-f2f0-320c-5571-90d7a144bdd3,1,e5f2d52b-8021-89ee-6588-65ca93d83a8f,dd7ddc04-e1b6-c2c6-1435-2b383efe2d36,2017-05-03 11:05:13,239.90,19.93
2,000229ec-3982-24ef-6ca0-657da4fc703e,1,c777355d-18b7-2b67-abbe-ef9df44fd0fd,5b51032e-ddd2-42ad-c84c-38acab88f23d,2018-01-18 14:48:30,199.00,17.87
3,00024acb-cdf0-a6da-a1e9-31b038114c75,1,7634da15-2a46-10f1-595e-fa32f14722fc,9d7a1d34-a505-2409-0064-25275ba1c2b4,2018-08-15 10:10:18,12.99,12.79
4,00042b26-cf59-d7ce-69df-abb4e55b4fd9,1,ac6c3623-068f-30de-0304-5865e4e10089,df560393-f3a5-1e74-553a-b94004ba5c87,2017-02-13 13:57:51,199.90,18.14

In [85]:
query = "SELECT * FROM order_payments"

df_order_payments = pd.read_sql_query(query, con = conn)
df_order_payments.head()

,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,b81ef226-f3fe-1789-b1e8-b2acac839d17,1,credit_card,8,99.33
1,a9810da8-2917-af2d-9aef-d1278f1dcfa0,1,credit_card,1,24.39
2,25e8ea4e-9339-6b6f-a0d3-dd708e76c1bd,1,credit_card,1,65.71
3,ba789979-21bb-cdc1-373b-b41e913ab953,1,credit_card,8,107.78
4,42fdf880-ba16-b47b-5925-1dd489d4441a,1,credit_card,2,128.45

In [86]:
query = "SELECT * FROM order_reviews"

df_order_reviews = pd.read_sql_query(query, con = conn)
df_order_reviews.head()

,review_id,order_id,review_score,review_comment_title,review_comment_message,review_creation_date,review_answer_timestamp
0,7bc24061-10b9-2639-3aa5-6f80a40eba40,73fc7af8-7114-b397-12e6-da79b0a377eb,4,None,None,2018-01-18,2018-01-18 21:46:59
1,80e641a1-1e56-f04c-1ad4-69d5645fdfde,a548910a-1c61-4779-6b98-fdf73dbeba33,5,None,None,2018-03-10,2018-03-11 03:05:13
2,228ce550-0dc1-d8e0-20d8-d1322874b6f0,f9e4b658-b201-a9f2-ecde-cbb34bed034b,5,None,None,2018-02-17,2018-02-18 14:36:24
3,e64fb393-e7b3-2834-bb78-9ff8bb30750e,658677c9-7b38-5a9b-e170-737859d3511b,5,None,Recebi bem antes do prazo estipulado.,2017-04-21,2017-04-21 22:02:06
4,f7c4243c-7fe1-938f-181b-ec41a392bdeb,8e6bfb81-e283-fa7e-4f11-123a3fb894f1,5,None,Parabéns lojas lannister adorei comprar pela I...,2018-03-01,2018-03-02 10:26:53

In [87]:
query = "SELECT * FROM orders"

df_orders = pd.read_sql_query(query, con = conn)
df_orders.head()

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date
0,e481f51c-bdc5-4678-b7cc-49136f2d6af7,9ef432eb-6251-2973-04e7-6186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18
1,53cdb2fc-8bc7-dce0-b674-1e2150273451,b0830fb4-747a-6c6d-20de-a0b8c802d7ef,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-07-26 14:31:00,2018-08-07 15:27:45,2018-08-13
2,47770eb9-100c-2d0c-4494-6d9cf07ec65d,41ce2a54-c0b0-3bf3-443c-3d931a367089,delivered,2018-08-08 08:38:49,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-08-17 18:06:29,2018-09-04
3,949d5b44-dbf5-de91-8fe9-c16f97b45f8a,f8819746-5ea7-920a-dcdb-ec7375364d82,delivered,2017-11-18 19:28:06,2017-11-18 19:45:59,2017-11-22 13:39:59,2017-12-02 00:28:42,2017-12-15
4,ad21c59c-0840-e6cb-83a9-ceb5573f8159,8ab97904-e6da-ea88-66db-dbc4fb7aad2c,delivered,2018-02-13 21:18:39,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-16 18:17:02,2018-02-26

In [88]:
query = "SELECT * FROM products"

df_products = pd.read_sql_query(query, con = conn)
df_products.head()

,product_id,product_category_name,product_name_length,product_description_length,product_photos_qty,product_weight_g,product_length_cm,product_height_cm,product_width_cm
0,1e9e8ef0-4dbc-ff45-41ed-26657ea517e5,perfumaria,40.0,287.0,1.0,225.0,16.0,10.0,14.0
1,3aa07113-9cb1-6b67-ca9e-5dea641aaa2f,artes,44.0,276.0,1.0,1000.0,30.0,18.0,20.0
2,96bd76ec-8810-374e-d1b6-5e291975717f,esporte_lazer,46.0,250.0,1.0,154.0,18.0,9.0,15.0
3,cef67bcf-e190-66a9-32b7-673e239eb23d,bebes,27.0,261.0,1.0,371.0,26.0,4.0,26.0
4,9dc1a7de-2744-4484-9c21-9cff195d0b71,utilidades_domesticas,37.0,402.0,4.0,625.0,20.0,17.0,13.0

In [89]:
query = "SELECT * FROM sellers"

df_sellers = pd.read_sql_query(query, con = conn)
df_sellers.head()

,seller_id,seller_zip_code_prefix,seller_city,seller_state
0,3442f895-9a84-dea7-ee19-7c632cb2df15,13023,campinas,SP
1,d1b65fc7-debc-3361-ea86-b5f14c68d2e2,13844,mogi guacu,SP
2,ce3ad9de-9601-02d0-677a-81f5d0bb7b2d,20031,rio de janeiro,RJ
3,c0f3eea2-e145-55b6-faee-a3dd58c1b1c3,4195,sao paulo,SP
4,51a04a8a-6bdc-b23d-eccc-82b0b80742cf,12914,braganca paulista,SP

## Análise Descritiva

#### Customers

In [90]:
print("Informações gerais:\n")
df_customers.info()

nan_counts = df_customers.isna().sum()
print("\nNúmero de NaNs:\n", nan_counts)

print("\nNúmero de valores únicos:")
df_customers.nunique()

Informações gerais:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         99441 non-null  object
 1   customer_unique_id  99441 non-null  object
 2   customer_zip_code   99441 non-null  int64
 3   customer_city       99441 non-null  object
 4   customer_state      99441 non-null  object
dtypes: int64(1), object(4)
memory usage: 3.8+ MB

Número de NaNs:
 customer_id           0
customer_unique_id    0
customer_zip_code     0
customer_city         0
customer_state        0
dtype: int64

Número de valores únicos:

customer_id           99441
customer_unique_id    96096
customer_zip_code     14994
customer_city          4119
customer_state           27
dtype: int64

A análise acima permite perceber que a única coluna sem valores repetidos é o `customer_id`, o qual atua como PK da tabela.

#### Geolocations

In [91]:
print("Informações gerais:\n")
df_geolocations.info()

nan_counts = df_geolocations.isna().sum()
print("\nNúmero de NaNs:\n", nan_counts)

print("\nNúmero de valores únicos:")
df_geolocations.nunique()

Informações gerais:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000163 entries, 0 to 1000162
Data columns (total 5 columns):
 #   Column                       Non-Null Count    Dtype
---  ------                       --------------    -----
 0   geolocation_zip_code_prefix  1000163 non-null  int64
 1   geolocation_lat              1000163 non-null  float64
 2   geolocation_lng              1000163 non-null  float64
 3   geolocation_city             1000163 non-null  object
 4   geolocation_state            1000163 non-null  object
dtypes: float64(2), int64(1), object(2)
memory usage: 38.2+ MB

Número de NaNs:
 geolocation_zip_code_prefix    0
geolocation_lat                0
geolocation_lng                0
geolocation_city               0
geolocation_state              0
dtype: int64

Número de valores únicos:

geolocation_zip_code_prefix     19015
geolocation_lat                717372
geolocation_lng                717615
geolocation_city                 8011
geolocation_state                  27
dtype: int64

Na tabela de geolocalizações, não existe PK única, e sim uma PK composta por `geolocation_zip_code_prefix`, `geolocation_lat` e `geolocation_lng`.

#### Order Items

In [92]:
print("Informações gerais:\n")
df_order_items.info()

nan_counts = df_order_items.isna().sum()
print("\nNúmero de NaNs:\n", nan_counts)

print("\nNúmero de valores únicos:")
df_order_items.nunique()

Informações gerais:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 112650 entries, 0 to 112649
Data columns (total 7 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   order_id             112650 non-null  object
 1   order_item_id        112650 non-null  int64
 2   product_id           112650 non-null  object
 3   seller_id            112650 non-null  object
 4   shipping_limit_date  112650 non-null  datetime64[ns]
 5   price                112650 non-null  float64
 6   freight_value        112650 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(3)
memory usage: 6.0+ MB

Número de NaNs:
 order_id               0
order_item_id          0
product_id             0
seller_id              0
shipping_limit_date    0
price                  0
freight_value          0
dtype: int64

Número de valores únicos:

order_id               98666
order_item_id             21
product_id             32951
seller_id               3095
shipping_limit_date    93318
price                   5968
freight_value           6999
dtype: int64

Assim como em geolocalizações, a tabela de itens do pedido também possui uma PK composta, que nesse caso é `order_id` e `order_item_id`, que representa o id pra cada item do pedido, numerado de 1 até o número de produtos do pedido.

#### Order Payments

In [93]:
print("Informações gerais:\n")
df_order_payments.info()

nan_counts = df_order_payments.isna().sum()
print("\nNúmero de NaNs:\n", nan_counts)

print("\nNúmero de valores únicos:")
df_order_payments.nunique()

Informações gerais:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 103886 entries, 0 to 103885
Data columns (total 5 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   order_id              103886 non-null  object
 1   payment_sequential    103886 non-null  int64
 2   payment_type          103886 non-null  object
 3   payment_installments  103886 non-null  int64
 4   payment_value         103886 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 4.0+ MB

Número de NaNs:
 order_id                0
payment_sequential      0
payment_type            0
payment_installments    0
payment_value           0
dtype: int64

Número de valores únicos:

order_id                99440
payment_sequential         29
payment_type                5
payment_installments       24
payment_value           29077
dtype: int64

Como um pedido pode ter várias formas de pagamento simultaneamente, a PK também é composta, nesse caso por `order_id` e `payment_sequential`, que representa o sequenciamento da quantidade de formas de pagamento escolhida.

#### Order Reviews

In [94]:
print("Informações gerais:")
df_order_reviews.info()

nan_counts = df_order_reviews.isna().sum()
print("\nNúmero de NaNs:\n", nan_counts)

print("\nNúmero de valores únicos:")
df_order_reviews.nunique()

Informações gerais:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99224 entries, 0 to 99223
Data columns (total 7 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   review_id                99224 non-null  object
 1   order_id                 99224 non-null  object
 2   review_score             99224 non-null  int64
 3   review_comment_title     11568 non-null  object
 4   review_comment_message   40977 non-null  object
 5   review_creation_date     99224 non-null  datetime64[ns]
 6   review_answer_timestamp  99224 non-null  datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(4)
memory usage: 5.3+ MB

Número de NaNs:
 review_id                      0
order_id                       0
review_score                   0
review_comment_title       87656
review_comment_message     58247
review_creation_date           0
review_answer_timestamp        0
dtype: int64

Número de valores únicos:

review_id                  98410
order_id                   98673
review_score                   5
review_comment_title        4527
review_comment_message     36159
review_creation_date         636
review_answer_timestamp    98248
dtype: int64

Nesse caso, existem valores nulos, pois clientes podem optar por não escrever título e comentário na review. O review_id também pode repetir, pois um cliente pode refazer sua review.

#### Orders

In [95]:
print("Informações gerais:")
df_orders.info()

nan_counts = df_orders.isna().sum()
print("\nNúmero de NaNs:\n", nan_counts)

print("\nNúmero de valores únicos:")
df_orders.nunique()

Informações gerais:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 8 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   order_id                       99441 non-null  object
 1   customer_id                    99441 non-null  object
 2   order_status                   99441 non-null  object
 3   order_purchase_timestamp       99441 non-null  datetime64[ns]
 4   order_approved_at              99281 non-null  datetime64[ns]
 5   order_delivered_carrier_date   97658 non-null  datetime64[ns]
 6   order_delivered_customer_date  96476 non-null  datetime64[ns]
 7   order_estimated_delivery_date  99441 non-null  datetime64[ns]
dtypes: datetime64[ns](5), object(3)
memory usage: 6.1+ MB

Número de NaNs:
 order_id                            0
customer_id                         0
order_status                        0
order_purchase_timestamp            0
order_approved_at                 160
order_delivered_carrier_date     1783
order_delivered_customer_date    2965
order_estimated_delivery_date       0
dtype: int64

Número de valores únicos:

order_id                         99441
customer_id                      99441
order_status                         8
order_purchase_timestamp         98875
order_approved_at                90733
order_delivered_carrier_date     81018
order_delivered_customer_date    95664
order_estimated_delivery_date      459
dtype: int64

Para os pedidos, os valores nulos existentes são em relação ao momentos de aprovação e entrega de pedidos. Ou seja, caso algum desses eventos não tenha ocorrido, haverá `NULL` no banco.

#### Products

In [96]:
print("Informações gerais:")
df_products.info()

nan_counts = df_products.isna().sum()
print("\nNúmero de NaNs:\n", nan_counts)

print("\nNúmero de valores únicos:")
df_products.nunique()

Informações gerais:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32951 entries, 0 to 32950
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   product_id                  32951 non-null  object
 1   product_category_name       32341 non-null  object
 2   product_name_length         32341 non-null  float64
 3   product_description_length  32341 non-null  float64
 4   product_photos_qty          32341 non-null  float64
 5   product_weight_g            32949 non-null  float64
 6   product_length_cm           32949 non-null  float64
 7   product_height_cm           32949 non-null  float64
 8   product_width_cm            32949 non-null  float64
dtypes: float64(7), object(2)
memory usage: 2.3+ MB

Número de NaNs:
 product_id                      0
product_category_name         610
product_name_length           610
product_description_length    610
product_photos_qty            610
product_weight_g                2
product_length_cm               2
product_height_cm               2
product_width_cm                2
dtype: int64

Número de valores únicos:

product_id                    32951
product_category_name            73
product_name_length              66
product_description_length     2960
product_photos_qty               19
product_weight_g               2204
product_length_cm                99
product_height_cm               102
product_width_cm                 95
dtype: int64

No caso dos produtos, a PK é `product_id` apenas. Existem alguns valores nulos, relacionados à descrição do produto.

#### Sellers

In [97]:
print("Informações gerais:")
df_sellers.info()

nan_counts = df_sellers.isna().sum()
print("\nNúmero de NaNs:\n", nan_counts)

print("\nNúmero de valores únicos:")
df_sellers.nunique()

Informações gerais:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3095 entries, 0 to 3094
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   seller_id               3095 non-null   object
 1   seller_zip_code_prefix  3095 non-null   int64
 2   seller_city             3095 non-null   object
 3   seller_state            3095 non-null   object
dtypes: int64(1), object(3)
memory usage: 96.8+ KB

Número de NaNs:
 seller_id                 0
seller_zip_code_prefix    0
seller_city               0
seller_state              0
dtype: int64

Número de valores únicos:

seller_id                 3095
seller_zip_code_prefix    2246
seller_city                611
seller_state                23
dtype: int64

Nessa tabela, não há valores nulos, e a PK é `seller_id`.

## Perguntas em relação ao dataset

### Pergunta 1: Quais são os 10 produtos mais vendidos?

Primeiro, é necessário saber quais são os possíveis status de um pedido, pois pedidos cancelados não podem ser incluídos.

In [98]:
df_orders['order_status'].value_counts()

order_status
delivered      96478
shipped         1107
canceled         625
unavailable      609
invoiced         314
processing       301
created            5
approved           2
Name: count, dtype: int64

Pedidos com `canceled` e `unavailable` não devem ser considerados.

In [99]:
query = """
    SELECT p.product_id, p.product_category_name, COUNT(o.order_id) as num_pedidos
    FROM products p INNER JOIN order_items oi
    ON p.product_id = oi.product_id
    INNER JOIN orders o
    ON oi.order_id = o.order_id
    WHERE o.order_status <> 'canceled'
    AND o.order_status <> 'unavailable'
    GROUP BY p.product_id, p.product_category_name
    ORDER BY num_pedidos DESC
    LIMIT 10
"""

df_top_10_vendidos = pd.read_sql_query(query, con=conn)
df_top_10_vendidos

                             product_id   product_category_name  num_pedidos
0  aca2eb7d-00ea-1a7b-8ebd-4e68314663af        moveis_decoracao          527
1  99a4788c-b248-5696-5c36-a24e339b6058         cama_mesa_banho          487
2  422879e1-0f46-6829-90de-24d770e7f83d      ferramentas_jardim          484
3  389d119b-48cf-3043-d311-335e499d9c6b      ferramentas_jardim          391
4  368c6c73-0842-d780-16ad-823897a372db      ferramentas_jardim          388
5  53759a2e-cdda-d2bb-87a0-79a1f1519f73      ferramentas_jardim          373
6  d1c42706-0a0f-73f6-b889-a5c7c61f2ac4  informatica_acessorios          341
7  53b36df6-7ebb-7c41-585e-8d54d6772e08      relogios_presentes          323
8  154e7e31-ebfa-0922-0379-5c972e5804a6            beleza_saude          281
9  3dd2a171-68ec-895c-781a-9191c1e95ad7  informatica_acessorios          274

### Pergunta 2: Quais são os 10 vendedores que mais vendem?

In [100]:
query = """
    SELECT s.seller_id, COUNT(o.order_id) as num_vendas
    FROM sellers s INNER JOIN order_items oi
    ON s.seller_id = oi.seller_id
    INNER JOIN orders o
    ON oi.order_id = o.order_id
    WHERE o.order_status <> 'canceled' 
    AND o.order_status <> 'unavailable'
    GROUP BY s.seller_id
    ORDER BY num_vendas DESC
    LIMIT 10;
"""

df_top_10_vendedores = pd.read_sql_query(query, con=conn)
df_top_10_vendedores

                              seller_id  num_vendas
0  6560211a-19b4-7992-c366-6cc44a7e94c0        2025
1  4a3ca931-5b74-4ce9-f8e9-374361493884        1985
2  1f50f920-176f-a81d-ab99-4f9023523100        1930
3  cc419e06-50a3-c5ba-7718-9a1882b7556a        1766
4  da8622b1-4eb1-7ae2-831f-4ac5b9dab84a        1551
5  955fee92-16a6-5b61-7aa5-c0531780ce60        1498
6  1025f0e2-d44d-7041-d6cf-58b6550e0bfa        1428
7  7c67e144-8b00-f6e9-69d3-65cea6b010ab        1364
8  ea8482cd-71df-3c19-69d7-b9473ff13abc        1202
9  7a67c85e-85bb-2ce8-582c-35f2203ad736        1170

### Pergunta 3: Qual o ranking de cidades com maior número de pedidos?

In [101]:
df_geolocations

,geolocation_zip_code_prefix,geolocation_lat,geolocation_lng,geolocation_city,geolocation_state
0,1037,-23.545621,-46.639292,sao paulo,SP
1,1046,-23.546081,-46.644820,sao paulo,SP
2,1046,-23.546129,-46.642951,sao paulo,SP
3,1041,-23.544392,-46.639499,sao paulo,SP
4,1035,-23.541578,-46.641607,sao paulo,SP
...,...,...,...,...,...
1000158,99950,-28.068639,-52.010705,tapejara,RS
1000159,99900,-27.877125,-52.224882,getulio vargas,RS
1000160,99950,-28.071855,-52.014716,tapejara,RS
1000161,99980,-28.388932,-51.846871,david canabarro,RS
1000162,99950,-28.070104,-52.018658,tapejara,RS

Considerando que o `zip_code` pode se repetir por conta das latitudes e longitudes, e essas não são convenientes para as análises, será realizado o `drop` delas, e então serão removidas linhas duplicadas. Além disso, é necessário realizar a normalização de strings com acentos em cidades. (ex: existe sao paulo e são paulo)
<br>
Após o tratamento, será criada uma nova tabela de geolocalizações no PostgreSQL.

In [102]:
df_geolocations_tratada = df_geolocations.drop(columns=['geolocation_lat', 'geolocation_lng'])
df_geolocations_tratada['geolocation_city'] = df_geolocations_tratada['geolocation_city'].str.normalize('NFKD').str.encode('ascii', errors = 'ignore').str.decode('utf-8')
df_geolocations_tratada.drop_duplicates(inplace = True)
df_geolocations_tratada

        geolocation_zip_code_prefix      geolocation_city geolocation_state
0                              1037             sao paulo                SP
1                              1046             sao paulo                SP
3                              1041             sao paulo                SP
4                              1035             sao paulo                SP
5                              1012             sao paulo                SP
...                             ...                   ...               ...
999774                        99955          vila langaro                RS
999780                        99970               ciriaco                RS
999786                        99910      floriano peixoto                RS
999803                        99920              erebango                RS
999846                        99952  santa cecilia do sul                RS

[19617 rows x 3 columns]

In [103]:
df_geolocations_tratada.to_sql('geolocations_tratada', con=engine, if_exists='replace', index=False)

617

In [104]:
query = """
    SELECT gt.geolocation_city, COUNT(o.order_id) as num_pedidos
    FROM geolocations_tratada gt INNER JOIN customers c
    ON gt.geolocation_zip_code_prefix = c.customer_zip_code
    INNER JOIN orders o
    ON o.customer_id = c.customer_id
    WHERE o.order_status <> 'canceled' 
    AND o.order_status <> 'unavailable'
    GROUP BY gt.geolocation_city
    ORDER BY num_pedidos DESC;
"""

df_ranking_cidades = pd.read_sql_query(query, con=conn)
df_ranking_cidades

             geolocation_city  num_pedidos
0                   sao paulo        15388
1              rio de janeiro         6861
2              belo horizonte         2753
3                    brasilia         1947
4                    curitiba         1505
...                       ...          ...
4206            vargem grande            1
4207                  caibate            1
4208             palminopolis            1
4209   divino das laranjeiras            1
4210  boa esperanca do iguacu            1

[4211 rows x 2 columns]

### Pergunta 4: Número de pedidos por mês

In [105]:
query = """
SELECT EXTRACT(MONTH FROM DATE_TRUNC('month', order_purchase_timestamp)) AS mes,
EXTRACT(YEAR FROM DATE_TRUNC('month', order_purchase_timestamp)) AS ano,
COUNT(order_id) num_pedidos
FROM orders
WHERE order_status<>'canceled' AND order_status<>'unavailable'
GROUP BY DATE_TRUNC('month', order_purchase_timestamp)
ORDER BY ano, mes
"""

vendas_por_mes = pd.read_sql_query(query, con=conn)
vendas_por_mes[['mes', 'ano']] = vendas_por_mes[['mes', 'ano']].astype('int64')
vendas_por_mes

    mes   ano  num_pedidos
0     9  2016            2
1    10  2016          293
2    12  2016            1
3     1  2017          787
4     2  2017         1718
5     3  2017         2617
6     4  2017         2377
7     5  2017         3640
8     6  2017         3205
9     7  2017         3946
10    8  2017         4272
11    9  2017         4227
12   10  2017         4547
13   11  2017         7423
14   12  2017         5620
15    1  2018         7187
16    2  2018         6625
17    3  2018         7168
18    4  2018         6919
19    5  2018         6833
20    6  2018         6145
21    7  2018         6233
22    8  2018         6421
23    9  2018            1

### Pergunta 5: Quais são os métodos de pagamento mais selecionados?

Primeiramente, é necessário descobrir os tipos de pagamento.

In [106]:
df_order_payments['payment_type'].unique()

array(['credit_card', 'boleto', 'voucher', 'debit_card', 'not_defined'],
      dtype=object)

In [107]:
query = """
SELECT payment_type, COUNT(order_id) as num_pedidos
FROM order_payments
GROUP BY payment_type
ORDER BY num_pedidos DESC
"""
metodos_pagamento = pd.read_sql_query(query, con=conn)
metodos_pagamento

  payment_type  num_pedidos
0  credit_card        76795
1       boleto        19784
2      voucher         5775
3   debit_card         1529
4  not_defined            3

### Pergunta 6: Média de produtos por pedido

Considerando que existem pedidos que aparecem várias vezes para discriminar cada produto presente, como no exemplo abaixo, é necessário pegar apenas o valor máximo para saber quantos itens há no pedido.

In [108]:
query = """
SELECT * FROM order_items
WHERE order_id = '8272b63d-03f5-f79c-56e9-e4120aec44ef'
ORDER BY order_item_id DESC
LIMIT 5
"""
df_exemplo = pd.read_sql_query(query, con=conn)
df_exemplo

,order_id,order_item_id,product_id,seller_id,shipping_limit_date,price,freight_value
0,8272b63d-03f5-f79c-56e9-e4120aec44ef,21,79ce45db-c2ea-29b2-2b5a-261bbb7b7ee7,2709af95-8749-9e95-e803-a6498a5a56e9,2017-07-21 18:25:23,7.8,6.57
1,8272b63d-03f5-f79c-56e9-e4120aec44ef,20,270516a3-f41d-c035-aa87-d220228f844c,2709af95-8749-9e95-e803-a6498a5a56e9,2017-07-21 18:25:23,1.2,7.89
2,8272b63d-03f5-f79c-56e9-e4120aec44ef,19,270516a3-f41d-c035-aa87-d220228f844c,2709af95-8749-9e95-e803-a6498a5a56e9,2017-07-21 18:25:23,1.2,7.89
3,8272b63d-03f5-f79c-56e9-e4120aec44ef,18,270516a3-f41d-c035-aa87-d220228f844c,2709af95-8749-9e95-e803-a6498a5a56e9,2017-07-21 18:25:23,1.2,7.89
4,8272b63d-03f5-f79c-56e9-e4120aec44ef,17,270516a3-f41d-c035-aa87-d220228f844c,2709af95-8749-9e95-e803-a6498a5a56e9,2017-07-21 18:25:23,1.2,7.89

In [110]:
query = """
	SELECT AVG(max_table.num_items) as media_itens_por_pedido
	FROM (
		SELECT order_id, MAX(order_item_id) as  num_items FROM order_items
		GROUP BY order_id
	) as max_table
"""
media_itens_por_pedido = pd.read_sql_query(query, con=conn)
media_itens_por_pedido

   media_itens_por_pedido
0                1.141731

### Pergunta 7: Quantidade de pedidos que chegaram a tempo e atrasados em cada estado

In [113]:
query = """
    SELECT gt.geolocation_state as estado,
    COUNT(CASE WHEN o.order_delivered_customer_date <= o.order_estimated_delivery_date THEN 1 END) as entregues_a_tempo,
    COUNT(CASE WHEN o.order_delivered_customer_date > o.order_estimated_delivery_date THEN 1 END) as entregas_atrasadas
    FROM orders o INNER JOIN customers c
    ON o.customer_id = c.customer_id
    INNER JOIN geolocations_tratada gt
    ON gt.geolocation_zip_code_prefix = c.customer_zip_code
    WHERE o.order_status = 'delivered'
    GROUP BY gt.geolocation_state
    ORDER BY gt.geolocation_state
"""
tempo_entregas = pd.read_sql_query(query, con=conn)
tempo_entregas

   estado  entregues_a_tempo  entregas_atrasadas
0      AC                122                   4
1      AL                311                  99
2      AM                139                   6
3      AP                 64                   3
4      BA               2897                 471
5      CE               1108                 199
6      DF               2671                 217
7      ES               1796                 250
8      GO               1816                 164
9      MA                596                 144
10     MG              10918                 661
11     MS                623                  81
12     MT                856                  62
13     PA                848                 120
14     PB                482                  58
15     PE               1440                 173
16     PI                398                  75
17     PR               4703                 249
18     RJ              11030                1742
19     RN                425                  51
20     RO                271                   8
21     RR                 36                   5
22     RS               5010                 387
23     SC               3369                 373
24     SE                283                  51
25     SP              39219                2442
26     TO                238                  35

### Pergunta 8: Média de gastos de cada cliente

In [116]:
query = """
    SELECT c.customer_unique_id as id_cliente, AVG(oi.price) as media_gastos
    FROM customers c INNER JOIN orders o
    ON c.customer_id = o.customer_id
    INNER JOIN order_items oi
    ON oi.order_id = o.order_id
    WHERE o.order_status <> 'canceled'
    AND o.order_status <> 'unavailable'
    GROUP BY id_cliente
    ORDER BY media_gastos desc
"""
gastos_cliente = pd.read_sql_query(query, con=conn)
gastos_cliente

                                 id_cliente  media_gastos
0      dc4802a7-1eae-9be1-dd28-f5d788ceb526   6735.000000
1      459bef48-6812-aa25-204b-e022145caa62   6729.000000
2      ff4159b9-2c40-ebe4-0454-e3e6a7c35ed6   6499.000000
3      eebb5dda-148d-3893-cdaf-5b5ca3040ccb   4690.000000
4      48e1ac10-9dec-bb87-765a-3eade6854098   4590.000000
...                                     ...           ...
94978  bd06ce0e-06ad-77a7-f681-f1a4960a3cc6      2.290000
94979  317cfc69-2e3f-86c4-5c95-697c61c853a6      2.200000
94980  4546caea-018a-d8c6-9296-4e3382debd19      1.514286
94981  b38211bd-797f-4fdd-81a9-8b9d1754b606      0.850000
94982  d80730c1-5c64-7bc8-f2ad-77c908ba5ca9      0.850000

[94983 rows x 2 columns]

### Pergunta 9: Média de nota por cliente

In [117]:
query = """
    SELECT c.customer_unique_id as id_cliente, AVG(orev.review_score) as nota_media, COUNT(orev.review_id) as qtd_reviews
    FROM customers c INNER JOIN orders o
    ON o.customer_id = c.customer_id
    INNER JOIN order_reviews orev
    ON orev.order_id = o.order_id
    GROUP BY id_cliente
    ORDER BY qtd_reviews DESC
"""
avaliacao_media = pd.read_sql_query(query, con=conn)
avaliacao_media

                                 id_cliente  nota_media  qtd_reviews
0      8d50f5ea-df50-201c-cdce-dfb9e2ac8455    4.764706           17
1      3e43e610-5506-432c-953e-165fb2acf44c    2.777778            9
2      b4e4f24d-e1e8-725b-74e4-a1f4975116ed    4.142857            7
3      ca77025e-7201-e3b3-0c44-b472ff346268    5.000000            7
4      1b6c7548-a2a1-f903-7c1f-d3ddfed95f33    5.000000            7
...                                     ...         ...          ...
95375  196fb9c6-acb3-d8e6-81f6-691d596a21fb    5.000000            1
95376  47c675a1-0318-0f8d-ee04-9e924404d6f0    4.000000            1
95377  bd547196-655b-3e60-326e-ea13cf1e37d2    5.000000            1
95378  28c40902-bbe4-870f-16d5-2a48f64e668f    4.000000            1
95379  3e668d1b-0839-49f2-e7e7-2a9cbb3d6079    4.000000            1

[95380 rows x 3 columns]

### Pergunta 10: Categoria mais vendidas por estado e sua respectiva quantidade

In [118]:
query = """
    WITH VendasCategorizadas AS(
        SELECT g.geolocation_state as estado, p.product_category_name as categoria, COUNT(p.product_category_name) as qtd_vendida
        FROM products p INNER JOIN order_items oi
        ON p.product_id = oi.product_id
        INNER JOIN orders o
        ON o.order_id = oi.order_id
        INNER JOIN customers c
        ON c.customer_id = o.customer_id
        INNER JOIN geolocations_tratada g
        ON g.geolocation_zip_code_prefix = c.customer_zip_code
        WHERE o.order_status = 'delivered'
        GROUP BY estado, categoria
    ),
    RankingCategorias AS (
        SELECT estado, categoria, qtd_vendida, RANK() OVER (PARTITION BY estado ORDER BY qtd_vendida DESC) AS ranking
        FROM VendasCategorizadas
    )
    SELECT estado,categoria,qtd_vendida
    FROM RankingCategorias
    WHERE ranking = 1
"""
top_categoria_por_estado = pd.read_sql_query(query, con = conn)
top_categoria_por_estado

   estado         categoria  qtd_vendida
0      AC     esporte_lazer           19
1      AL      beleza_saude           65
2      AM      beleza_saude           20
3      AP      beleza_saude           10
4      BA      beleza_saude          350
5      CE      beleza_saude          165
6      DF      beleza_saude          345
7      ES   cama_mesa_banho          230
8      GO   cama_mesa_banho          236
9      MA      beleza_saude           91
10     MG   cama_mesa_banho         1350
11     MS     esporte_lazer           74
12     MT      beleza_saude           91
13     PA      beleza_saude          109
14     PB      beleza_saude           77
15     PE      beleza_saude          235
16     PI      beleza_saude           53
17     PR  moveis_decoracao          516
18     RJ   cama_mesa_banho         1646
19     RN      beleza_saude           57
20     RO      beleza_saude           28
21     RR     esporte_lazer            8
22     RS   cama_mesa_banho          621
23     SC     esporte_lazer          373
24     SE      beleza_saude           38
25     SP   cama_mesa_banho         5316
26     TO      beleza_saude           35